In [2]:
import pandas as pd

In [6]:
dataset = pd.read_csv("padas_question.csv")

In [81]:
dataset

      Name  Gender  Age  Height (cm)  Weight (kg)         City       BMI
0    Alice  Female   25          165           58     New York  0.002130
1      Bob    Male   30          180           80  Los Angeles  0.002469
2  Charlie    Male   35          175           70      Chicago  0.002286
3    Diana  Female   28          170           65        Miami  0.002249
4      Eva  Female   27          175           60     New York  0.001959
5    Frank    Male   40          190           85      Houston  0.002355
6    Grace  Female   32          168           55      Chicago  0.001949
7    Henry    Male   45          175           75  Los Angeles  0.002449
8      Ivy  Female   26          172           63        Miami  0.002130
9     Jack    Male   28          180           78     New York  0.002407

### 1. Import pandas and read the data into a DataFrame. Print the first 5 rows of the DataFrame.

In [8]:
import pandas as pd

In [12]:
dataset = pd.read_csv("padas_question.csv")

In [13]:
dataset

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York
5    Frank    Male   40          190           85      Houston
6    Grace  Female   32          168           55      Chicago
7    Henry    Male   45          175           75  Los Angeles
8      Ivy  Female   26          172           63        Miami
9     Jack    Male   28          180           78     New York

In [15]:
dataset.head(5)

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York

### 2. Print the number of rows and columns in the DataFrame.

In [102]:
print("numbers of rows:",dataset.shape[0])

print("number of coloumns:",dataset.shape[1])

numbers of rows: 10
number of coloumns: 8

### 3. Print the null value count

In [32]:
null_count= dataset.isnull().sum()

In [33]:
print(null_count)

Name           0
Gender         0
Age            0
Height (cm)    0
Weight (kg)    0
City           0
dtype: int64

### 4. Print the average age, height, and weight of the people in the DataFrame.

In [37]:
average_age = dataset["Age"].mean()
print("Average Age:",average_age)

average_height = dataset["Height (cm)"].mean()
print("Average height:",average_height)

average_weight = dataset["Weight (kg)"].mean()
print("Average height:", average_weight)

Average Age: 31.6
Average height: 175.0
Average height: 68.9

### 5. Print the name and city of the person who is the tallest in the DataFrame.

In [124]:
tallest_person = dataset.loc[dataset["Height (cm)"].idxmax()]

print(f"The tallest person is {tallest_person['Name']} from {tallest_person['City']}.")

The tallest person is Frank from Houston.

### 6. Create a new column in the DataFrame called "BMI" that calculates the body mass index of each person. BMI is calculated as weight (kg) divided by height (m) squared. Print the DataFrame with the new column.

In [98]:
dataset['height_m'] = (dataset['Height (cm)'] / 100) ##convert cm to m

## BMI

dataset['BMI'] = dataset['Weight (kg)'] / (dataset['height_m']** 2)
print(dataset)

      Name  Gender  Age  Height (cm)  Weight (kg)         City        BMI  \
0    Alice  Female   25          165           58     New York  21.303949
1      Bob    Male   30          180           80  Los Angeles  24.691358
2  Charlie    Male   35          175           70      Chicago  22.857143
3    Diana  Female   28          170           65        Miami  22.491349
4      Eva  Female   27          175           60     New York  19.591837
5    Frank    Male   40          190           85      Houston  23.545706
6    Grace  Female   32          168           55      Chicago  19.486961
7    Henry    Male   45          175           75  Los Angeles  24.489796
8      Ivy  Female   26          172           63        Miami  21.295295
9     Jack    Male   28          180           78     New York  24.074074

   height_m
0      1.65
1      1.80
2      1.75
3      1.70
4      1.75
5      1.90
6      1.68
7      1.75
8      1.72
9      1.80

### 7. Group the data by gender and print the average age, height, and weight of males and females separately.

In [107]:
gender = dataset.groupby('Gender')

result = gender.agg({'Age': 'mean','Height (cm)': 'mean','Weight (kg)': 'mean'})

print(result)

         Age  Height (cm)  Weight (kg)
Gender
Female  27.6        170.0         60.2
Male    35.6        180.0         77.6

### 8. Sort the data by age in ascending order and print the first 3 rows of the sorted DataFrame.

In [110]:
sort = dataset.sort_values(by="Age")

print(sort.head(3))

    Name  Gender  Age  Height (cm)  Weight (kg)      City        BMI  height_m
0  Alice  Female   25          165           58  New York  21.303949      1.65
8    Ivy  Female   26          172           63     Miami  21.295295      1.72
4    Eva  Female   27          175           60  New York  19.591837      1.75

### 9. Filter the data to only include people who live in New York and print the resulting DataFrame.

In [119]:
people = dataset[dataset['City'] == 'New York']

print(people)

    Name  Gender  Age  Height (cm)  Weight (kg)      City        BMI  height_m
0  Alice  Female   25          165           58  New York  21.303949      1.65
4    Eva  Female   27          175           60  New York  19.591837      1.75
9   Jack    Male   28          180           78  New York  24.074074      1.80